[{"id":"0.3262993147595752","title":"The Hero and the Crown","author":"Robin McKinley","imageUrl":"https://images-na.ssl-images-amazon.com/images/I/51JaKxj3MVL._SX325_BO1,204,203,200_.jpg","price":"9.99","summary":"Although she is the daughter of Damar's king, Aerin has never been accepted as full royalty. Both in and out of the royal court, people whisper the story of her mother, the witchwoman, who was said to have enspelled the king into marrying her to get an heir to rule Damar-then died of despair when she found she had borne a daughter instead of a son. But none of them, not even Aerin herself, can predict her future-for she is to be the true hero who will wield the power of the Blue Sword..."},{"id":"0.21381539574589947","title":"The Thirteenth Child","author":"Patricia Wrede","imageUrl":"https://images-na.ssl-images-amazon.com/images/I/518a7jzf3iL._SY291_BO1,204,203,200_QL40_FMwebp_.jpg","price":"6.19","summary":"Eff was born a thirteenth child. Her twin brother, Lan, is the seventh son of a seventh son. This means he's supposed to possess amazing talent -- and she's supposed to bring only bad things to her family and her town. Undeterred, her family moves to the frontier, where her father will be a professor of magic at a school perilously close to the magical divide that separates settlers from the beasts of the wild.\r\nWith wit and wonder, Patricia Wrede creates an alternate history of westward expansion that will delight fans of both J. K. Rowling and Laura Ingalls Wilder."},{"id":"0.5940322896743353","title":"Across the Great Barrier","author":"Patricia Wrede","imageUrl":"https://images-na.ssl-images-amazon.com/images/I/51z4bJSW7vL._SY291_BO1,204,203,200_QL40_FMwebp_.jpg","price":"13.89","summary":"From New York Times #1 bestselling author Patricia C. Wrede, the second in the series of magic on the western frontier.\r\n\r\nEff is riding west, away from the safety of the frontier city she's always known.... Eff could be a powerful magician if she wanted to. Except she's not sure she wants that kind of responsibility. Everyone keeps waiting for her to do something amazing--or to fail in a spectacular way. Worse, her twin brother, Lan, a powerful double seventh son, is jealous of all the attention she's been getting. Even as Eff protests that she's just an ordinary girl, she's asked to travel past the Barrier Spell with one of the new professors at her father's school. The land west of the Barrier is full of dangers, both magical and wild. Eff will need to use all her strength--magical and otherwise--to come safely back home. With wit, magic, and a touch of good pioneer sense, Patricia C. Wrede once again weaves a fantastic tale of the very wild west. "},{"id":"0.5753978350390225","title":"The Far West","author":"Patricia Wrede","imageUrl":"https://images-na.ssl-images-amazon.com/images/I/51PKMvYOvuL._SY291_BO1,204,203,200_QL40_FMwebp_.jpg","price":"17.90","summary":"From #1 New York Times bestselling author Patricia C. Wrede, the fantastic conclusion to her tale of magic on the western frontier.\r\n\r\nEff is an unlucky thirteenth child...but also the seventh daughter in her family. Her twin brother, Lan, is a powerful double seventh son. Her life at the edge of the Great Barrier Spell is different from anyone else's that she knows.When the government forms an expedition to map the Far West, Eff has the opportunity to travel farther than anyone in the world. With Lan, William, Professor Torgeson, Wash, and Professor Ochiba, Eff finds that nothing on the wild frontier is as they expected. There are strange findings in their research, a long prarie winter spent in too-close quarters, and more new species, magical and otherwise, dangerous and benign, than they ever expected to find. And then spring comes, and the explorers realize how tenuous life near the Great Barrier Spell may be if they don't find a way to stop a magical flood in a hurry. Eff's unique way of viewing magic has saved the settlers time and again, but this time all of Columbia is at stake if she should fail. "},{"id":"0.22848766999067882","title":"The Blue Sword","author":"Robin McKinley","imageUrl":"https://images-na.ssl-images-amazon.com/images/I/51zevMWTLyL._SX325_BO1,204,203,200_.jpg","price":"8.99","summary":"Harry Crewe is an orphan girl who comes to live in Damar, the desert country shared by the Homelanders and the secretive, magical Free Hillfolk. When Corlath, the Hillfolk King, sees her for the first time, he is shaken—for he can tell that she is something more than she appears to be. He will soon realize what Harry has never guessed: She is to become Harimad-sol, King’s Rider, and carry the Blue Sword, Gonturan, which no woman has wielded since the legendary Lady Aerin, generations past."},{"id":"0.6962543116503941","title":"The Outlaws of Sherwood","author":"Robin McKinley","imageUrl":"https://images-na.ssl-images-amazon.com/images/I/51grR-y8W0L._SY291_BO1,204,203,200_QL40_FMwebp_.jpg","price":"8.17","summary":"Young Robin Longbow, subapprentice forester in the King's Forest of Nottingham, must contend with the dislike of the Chief Forester, who bullies Robin in memory of his popular father. But Robin does not want to leave Nottingham or lose the title to his father's small tenancy, because he is in love with a young lady named Marian - and keeps remembering that his mother too was gentry and married a common forester.\r\n\r\nRobin has been granted a rare holiday to go to the Nottingham Fair, where he will spend the day with his friends Much and Marian. But he is ambushed by a group of the Chief Forester's cronies, who challenge him to an archery contest...and he accidentally kills one of them in self-defense.\r\n\r\nHe knows his own life is forfeit. But Much and Marian convince him that perhaps his personal catastrophe is also an opportunity: an opportunity for a few stubborn Saxons to gather together in the secret heart of Sherwood Forest and strike back against the arrogance and injustice of the Norman overlords."}]